{
    "homepage": "https://minecraft.curseforge.com/projects/immersive-engineering",
    "promos": {
        "1.20.1-latest": "1.20.1-10.1.0-171",
        "1.20.1-recommended": "1.20.1-10.1.0-171"
    },
    "1.20.1": {
        "1.20.1-10.0.0-169": "- First release for 1.20.1, now supporting NeoForged!\n- Includes all features from 9.4.1\n- Add sawmill support for stripped wood (BluSunrize)\n- Add sawmill support for cherry wood (BluSunrize)\n- Add cloche support for torchflowers (BluSunrize)\n- Change hemp blocks to extend vanilla's CropBlock (BluSunrize)",
        "1.20.1-10.1.0-171": "- Includes all features from 9.2.4\n- Add sounds for Arc Furnace, Excavator, and Automated Workbench (voidsong-dragonfly)\n- Add burn times for the diesel generator to the manual (BluSunrize)\n- Add support for armor trims on steel armor (BluSunrize)\n- Add additional uses for lead & nickel (voidsong-dragonfly)\n    - Lead can be crafted into red and white dyes\n    - Radiators now use constantan instead of copper\n    - Tinted glass can be made in larger quantities by using lead\n- Add randomized textures for various hempcrete & concrete blocks (voidsong-dragonfly)\n- Add the electromagnet block (BluSunrize)\n    - It attracts nearby items when given power! \n- Add the portable electromagnet! (BluSunrize)\n    - Install it as an upgrade on your accumulator backpack to have a magnet on the go!\n- Add various blocks from Engineer's Decor (voidsong-dragonfly)\n    - Thank you wilechaote for giving us permission to include these blocks in the mod <3\n- Add additional fertilizers for the cloche (voidsong-dragonfly)\n    - This should allow people to use up their surplus suflur!\n- Add ability to place Engineer's Manual in a chiseled bookshelf (BluSunrize)\n- Add sawmill recipes for bamboo (BluSunrize)\n- Change hemp blocks to notify their neighbours when they grow (jrtc27)\n- Change Jade Tooltips for multiblocks to work when looking at any part of the machine (HermitOwO)\n- Fix conveyor rendering in the manual (Malte)\n- Fix broken translation keys (Malte & BluSunrize)\n- Fix turret GUI textfield not being editable (BluSunrize)\n- Fix taiga villager houses being surrounded by air blocks (BluSunrize)\n- Fix redstone control not working on the assembler (BluSunrize)\n- Fix villager names not being translated in JER and EMI (BluSunrize)\n- Fix error related to deprecated unicode font (BluSunrize)\n- Fix bottling machine deleting items on the conveyor (BluSunrize)\n- Fix bottling machine not rendering bucket-filling recipes properly (BluSunrize)\n- Fix hemp replacing blocks above it when growing (BluSunrize)\n- Fix fluid pipes losing their colour because the chunk wasn't marked as dirty (BluSunrize)\n- Fix transparency issues with the shield and a few other item models (BluSunrize)\n- Fix spawn interdiction from lanterns not working (BluSunrize)\n- Fix rare crash in arc recycling calculation (BluSunrize)\n- Fix possible crash in conveyor rendering (BluSunrize)\n- Translations Added/Updated: ja_jo (karakufire)"
    }
}