{
    "homepage": "https://minecraft.curseforge.com/projects/immersive-engineering",
    "promos": {
        "1.8.9-latest": "0.8-28",
        "1.8.9-recommended": "0.8-28",
        "1.9.4-latest": "0.9-29",
        "1.9.4-recommended": "0.9-29",
        "1.10.2-latest": "0.10-58",
        "1.10.2-recommended": "0.10-58",
        "1.11.2-latest": "0.11-63",
        "1.11.2-recommended": "0.11-63",
        "1.12.2-latest": "0.12-89",
        "1.12.2-recommended": "0.12-89"
    },
    "1.8.9": {
        "0.8-24": "- massive shoutout to Malte for figuring out some proper wire rendering! :D\n- added compat for DenseOres (crushing/smelting) \n- fixed lanterns not emitting light\n- fixed silver bullets causing a crash\n- fixed gunpowder barrels crashing because of a duplicate datamarker\n- fixed gunpowder barrels dropping from explosions\n- fixed CokeOvens not interacting with hoppers\n- fixed wires not outputting to RF-only receivers (thanks Malte)\n- fixed connections on HV relays (thanks Malte)\n- fixed a crash caused by hammering the top/bottom of a wooden post\n- fixed the stackoverflow in sheetmetal tanks\n- fixed the themoelectric gen crashing (thanks Malte)\n- fixed the waterwheels breaking more other wheels (thanks Malte)\n- fixed textures on stone slabs (thanks Malte)",
        "0.8-25": "- wires can transfer across unloaded chunks now! :D (thanks Malte)\n- added reinforced (creeper-proof) storage crates\n- changed voltmeter to allow measuring between two non-output points (thanks Malte)\n- fixed an NPE in rendering\n- fixed fluid pipes not rendering properly\n- fixed invalidly added recipe to create dusts where no ignots exist\n- fixed missing coke dust recipe\n- fixed Arc Furnace not having solid sides\n- fixed NPE in Improve Blast Furnace's capabilities\n- fixed Crash with the Mining Drill (thanks Malte)\n- fixed watermill outputting less than it should because of broken math (thanks Malte)\n- fixed extremely high losses on wires (thanks Malte)\n- fixed insulating glass being opaque (thanks Malte)\n- ported miscellaneous other fixes from 1.7 (thanks Malte)\n- added zh_CN localization (thanks to 3TUSK, Amamiya-Nagisa, bakaxyf, CannonFotter, crafteverywhere, IamAchang, Joccob, LYDfalse, UUUii)",
        "0.8-26": "- IE REQUIRES JAVA 8 NOW!\n- added a load of Tinkers Construct compat:\n\t- Treated Wood tool material. Similar to normal wood, but no splinters\n\t- Constantan tool material. Additional weapon effects based on biome temperature\n\t- Slime Fluids works in the chemthrower again\n\t- fixed smeltery alloy recipe for Constantan\n- re-added InvTweaks compat to the Wooden Crates\n- re-added Railgun and Chemthrower documentation to the manual\n- buffed the default damage of the Railgun\n- changed silver bullets to do extra damage to undead (Witchery isn't updated, so they'd be useless otherwise)\n- fixed Multiblocks looking derpy when formed (thanks Malte)\n- fixed connection offsets on transformers (thanks Malte)\n- improved connections on transformers (thanks Malte)\n- fixed connections on pipes looking weird and broken (thanks Malte)\n ",
        "0.8-27": "- re-added documentation on biodiesel (thanks Malte)\n- re-added the Assembler! For all your autocrafting needs!\n- changed the plantoil value for hemp seeds back to what it was in 1.7.10\n- changed internal rendering of connectors to use vflip again rather than flipped textures (thanks Malte)\n- changed conveyor belts to halt their animation when red\n- added comparator support to the current transformer (thanks Malte)\n- added a hacky workaround for WAILA making wires look bad (WAILA should fix this, but we'll manage) (thanks Malte)\n- added a manual page for Uranium Ore\n- added a proper sound to the revolver firing\n- added the Tesla Coil! It will shock you!\n- added the ability to allow Tinkers Tools to the toolbox, as well as a better API to allow adding them (thanks Malte)\n- fixed sheetmetal tanks showing the wrong structure in the manual\n- fixed recipe for leaded concrete stairs\n- fixed gunpowder barrels exploding when punched\n- fixed pipes not visually connecting to refinery\n- fixed the arc furnace only processing one item at a time (thanks Malte)\n- fixed the arc furnace voiding items if the first output slot is full (thanks Malte)\n- fixed TESR render crash (I still totally blame Vanilla/Forge for that) (thanks Malte)\n- fixed invisible molten metals in Tinkers compat (thanks Malte)\n- fixed pipes not transferring properly (thanks Malte)\n- fixed invisible wires on balloons (thanks Malte)\n- fixed balloons not being placeable in mid air (thanks Malte)\n- fixed bottles not getting filled in squeezer/fermenter (thanks Malte)\n- fixed Skyhook pulling people into walls (thanks Malte)\n- fixed Dropping Conveyors not dropping (thanks Malte)\n- fixed entities getting stuck on uphill conveyors (thanks Malte)\n- fixed scaffolding not beign climbable (thanks Malte)\n- fixed the crusher still hurting entities even when turned off (thanks Malte)\n- fixed IE blocks not being chiselable (thanks Malte)\n- fixed maneuver gear dupe bug (thanks Malte)\n- fixed furnaces not lighting up when using external heater (thanks Malte)\n- fixed scaffolding not being placeable while jumping (thanks Malte)\n- fixed preheaters not consuming power correctly and not having a manual entry\n- fixed crusher crushing entities on collision",
        "0.8-28": "- re-added the Floodlight back in\n- re-added the transformers that can attach to posts (thanks Malte)\n- re-added the ability for the pump to not create cobblestone and improved the pump (thanks Malte)\n- added the Faraday Suit, an armor to survive tesla coils and allow for lightshows! (code by Malte, art by Mr. Hazard)\n- added sound and nicer animations to the metal press\n- added new textures for the Capacitors! Celebrating IE's one year of public release! :D\n- changed recipes for WireCoil. They now take wire which is made out of plate with shears/wirecutters or with the metal press\n- changed wirecutters to take durability damage when removing wires from connectors\n- added fluorescent tubes. They glow when near a tesla coil! (thanks Malte)\n- added a \"Bad Eyesight\" config to make the manual render in darker, bold font. Can mess up formatting\n- fixed a crash and dupe bug with the toolbox (thanks Malte)\n- fixed weird render issues and crashes with multiblocks (thanks Malte)\n- fixed silo voiding items (thanks Malte)\n- fixed a crash when exploding bullets hit reactive creatures like endermen (thanks Malte)\n- fixed a crash when pumping fluids out of sheetmetal tanks (thanks Malte)\n- fixed rotation bug on the bucketwheel (thanks Malte)\n- fixed a bug where houses try to spawn the nonexistent villager\n- fixed most IE blocks letting through light when they shouldn't (thanks Malte)"
    },
    "1.9.4": {
        "0.9-29": "- UPDATE TO 1.9.4\n- mostly port, movign stuff to new fluid systems, capabilities, etc\n- moved 3D Maneuver gear. It didn't fit the style of hte mod and was incredibly glitchy"
    },
    "1.10.2": {
        "0.10-30": "- UPDATE TO 1.10.2",
        "0.10-31": "- added Redstone Wire connector\n- cleaned up recipes and manual a little\n- fixed wire rendering\n- fixed crash with cart shaders",
        "0.10-33": "- fixed crashes when break smart models, parsed texture into baked builder\n- fixed ItemRenders for multiblocks\n- fixed rendering of Wind- and Watermills\n- fixed entrylsits in the manual being short\n- fixed the forming of multiblocks scrambling the player's inventory\n- fixed treated wood recipe consuming buckets (Forge Bug, really...)\n- fixed machines crashign when fillign buckets internally",
        "0.10-34": "- added TCon alloy recipes\n- fixed crash in earmuff recipe, using a client access method\n- fixed arc alloy recipes having too little output\n- prepping for FastTESR hopefully soon!",
        "0.10-35": "- re-added Open Computers compat\n- cahnged waterwheel and windmills to use FastTESR\n- fixed NPE in ShapedIngredientRecipe\n- fixed Treated Wood display in the TCon Book",
        "0.10-36": "- added Hemp Seeds to Forestry's bags\n- changed Windmill and Improved Windmill to have models with 90% less polys. PERFORMANCE!\n- removed unnecesary debug outprints\n- fixed NPE in manual\n- fixed issues on the manual's mineral pages\n- fixed models for coresamples",
        "0.10-37": "- added the new IBullet system!\n    - bullets are no longer based on metadata, but use NBT tags to differentiate types, their abilities are handled externally\n    - updated manual accordingly\n- added recipe for leaded concrete\n- changed Conveyors to have a better placement system\n- fixed crashes when shiftclicking in revolver gui\n- fixed slots not assignign properly in revolver gui\n- fixed a bunch of manual things",
        "0.10-38": "- added the new IConveyorBelt system\n    - fully dynamic conveyor system, with custom models and all\n    - addon mods can easily add their own!\n    - features magnet prevention. Works on EIO, in future BM and Reliquary (?)\n- added Crusher recipe for coke blocks\n- re-added EIO compat, mostly Arc Recipes\n- fixed Assembler not assembling (thanks Alex)\n- fixed Chemthrower Projectiles making arrow noises\n- possible fix for the black rendering wires\n- fixed (finally, hopefully) the desync caused by forming Coke Oven and Blast Furnace",
        "0.10-39": "- added Bloodmagic compat:\n    - demon will bullets. 'nuff said.\n- re-added Chisel Compat. Won't work till Chisel actually brigns IMC integration back in\n- re-added Botania compat:\n    - conveyor belts are immune to magnets\n    - terrasteel bullets are back\n    - armed the potatoes\n- re-added Wolfpack Cartridges!\n- changed Water- and Windmills to use normal TESR again after all\n- changed Lanterns to be rotateable with the hammer\n- changed a load of Assembler functionality. Fixed fluid crafting and container items\n- changed multiblocks in the manual to indicate whether the components are in your inventory\n- changed arcfurnace to output slag faster\n- fixed lighting on wires and connectors (thanks Malte)\n- fixed wire rendering accross chunks; they split into two renders to at least give indication now (thanks Malte)\n- fixed recipes for Faraday Armor\n- fixed incorrect checks for empty lists when creating ingredient stacks\n- fixed Universal Bucket being initialized too late\n- fixed crashes relating to missign Railgun ammo\n- fixed Wooden Posts not extending arms\n- fixed derpy looking railgun and missing sounds on the Revolver\n- fixed windmills not recognizing walls properly\n- fixed JEI rendering for Metal Press and Crusher\n- fixed multiple capability issues on IE tiles\n- fixed conveyors shooting items out to the sides when inserted into\n- fixed floodlights crashing on placement\n- fixed balloons not being consumed when placed in the air and suffocating players\n- fixed conveyors from the creative menu being unplaceable\n- fixed dieselgen crashing for invalid fuel\n- fixed rotations on the bucket wheel\n- fixed broken renderign on the ear defenders\n- fixed drill and chemthrower losing fluid when modifying\n- fixed shiftclicking bullets into the revolver\n- fixed dieselgen and refinery not accepting fluids when mirrored\n- fixed hemp being plantable on non-farmland\n- fixed arcfurnace consuming too many additives\n- various other small fixes!",
        "0.10-40": "- fixed machines crashing\n- fixed sheetmetal tank not outputting",
        "0.10-41": "- added the function to dye conveyor belts!\n- added the splitting conveyor belt, it alternates left and right!\n- re-added the ability to pull recipes from JEI into the assembler\n- re-added charge counter to railgun\n- re-added some missing achievements\n- re-added the ability to cover pipes in scaffold. IMC messages an define additional whitelisted blocks\n- re-added Crafttweaker/Minetweaker integration\n- updated TCon compat to latest TCon\n- removed Fluid Bottles. People can shut up about those now >_>\n- fixed Assembler not crafting and occasionally crashing\n- fixed Arc Furnace rendering, output rates and dupebugs\n- fixed slab rendering\n- fixed wooden crates not updating comparators\n- fixed floodlight being terrible (thanks Malte)\n- fixed lots of bugs with wire models (thanks Malte)\n- fixed crashes with projectiles\n- fixed SkyHook being derpy\n- fixed Transformers not attaching on posts\n- fixed IE blocks not having placement sounds\n- fixed selection and colision bounds on multiple blocks\n- fixed OC comapt on the crusher being borked (thanks Malte)\n- fixed lootentry access error (thanks Malte)\n- fixed wires sometimes not rendering on servers\n- fixed a manual derp (thanks Malte)",
        "0.10-42": "- fixed NPE when throwign items into the crusher\n- attempted fix for render crashes with TESRs and their blockstates",
        "0.10-43": "- added version dependency for TCon to prevent further reports of that\n- added Banners! They look awesome! Shoutouts to Tris for making all the textures!\n- added support for TConstructs resourcepack based materials\n- added Strip Curtains. Purely decorative, dyeable, pretty nice for factories!\n- re-added the ability to climb scaffolding on pipes\n- re-added the Lightning Rod!\n- expanded the \"allow\" and \"interdict\" functions on the Hammer in regards to multiblocks\n- expanded the API on wires for an addon\n- changed manualpages for Multiblocks to be better at everything (thanks boni)\n- greatly improved renderperformance on waterwheels and windmills (thanks Malte)\n- fixed wooden barrels not being toggleable\n- fixed wooden barrels acceptign invalid fluids\n- fixed side-solidity on pumps\n- fixed changelog display in the Engineer's Manual\n- fixed jerrycans not getting filled properly and beign lost in crafting\n- fixed broken villager trades\n- fixed glitches in the toolbox (hopefully)\n- fixed <ERROR> overlays when WAWLA is installed (thanks Malte)\n- fixed WAILA display for EnergyProviders\n- fixed crash with Phial Cartridges\n- fixed Homing Cartridges not doing damage\n- fixed CraftTweaker method name\n- fixed Balloons not emitting light\n- fixed crash during Arc Furnace recycling calculations (thanks Malte)\n- fixed Bucket Wheel continuing to rotate when the Excavator is broken and desyncing (thanks Malte)\n- fixed LootEntry manipulation (3rd time's the charm?) (thanks Malte)\n- fixed crash with Railcraft (thanks Malte)",
        "0.10-44": "- fixed clientside exception",
        "0.10-45": "- change over to Forge's new config system:\n    - DELETE YOUR IE CONFIG\n    - Or don't, but you'll get a load of duplicate and unnecessary options.\n    - If an old config breaks anything, you were warned.\n- added WAILA support for Tesla Coils\n- added The One Probe Compat for machines and energy storage\n- added a config option to disable villagers and their houses\n- added a config option to disable OreDict names in Advanced Tooltips\n- re-added config option for Railgun damage\n- re-added support for Railcrafts rails and rebar to be used as projectiles\n- re-added shader support for Railcraft carts\n- re-added the placement options for Redstone Breakers (thanks Malte)\n- changed blocks with configurable sides (capacitors, barrels) to use unlisted properties and lazy loading. Reduces IE's model count at startup by >75%\n- change Refinery model to have a big power input like Fermenter and Squeezer\n- fixed Refinery not properly accepting fluids\n- fixed crash when crafting cetain items (thanks Malte)\n- fixed Conveyors dropping invalid items (thanks Malte)\n- fixed Pumps not working due to miscalculated XORs (thanks Malte)\n- fixed Watermills having too small models\n- fixed wonky wire rendering (thanks Malte)\n- fixed material list for the Lightning Rod\n- fixed Faraday suit not blocking Tesla damage\n- fixed Floodlight having broken rendering and expanded computer support (thanks Malte)\n- fixed Buckshot projectiles not applying full damage\n- fixed Scaffolding not rendering properly on the inside\n- fixed breakerswitch not emitting redstone\n- fixed force chunkloading through redstone connectors\n- fixed Toolbox voiding items\n- fixed Pipes resetting connection configs (thanks Malte)\n- fixed Silo voiding items and not having Comparator output\n- fixed Pipes not dropping their covers\n- fixed placement logic for multiblock placements (posts, transformers, drill, teslacoil)\n- fixed CraftTweaker integration for the Refinery\n- fixed stair rendering\n- fixed explosion resistance for leaded concrete stairs and slabs\n- fixed Crusher overloading its process queue\n- fixed multiple minor issues",
        "0.10-46": "- fixed serverside crash due to abstract proxy\n- fixed mcmod.info file",
        "0.10-47": "- moved all clientside references from the config",
        "0.10-48": "- added CTM support to Engineering Blocks and Scaffolds when Chisel is installed (in cooperation with Drullkus)\n- changed Breakers to be rotatable (thanks Malte)\n- changed Conveyor Belts showing walls when having their sides towards a metal press or assembler\n- fixed missing comments in the config file\n- fixed breaker switches crashing on servers (thanks Malte)\n- fixed IE models causing lag on chunk updates (thanks Malte)\n- fixed Breaker Switches not outputting redstone signals (thanks Malte)\n- fixed Redstone Breakers ignoring their inversion (thanks Malte)\n- fixed Ear Defenders being broken (thanks Malte)\n- fixed Squeezers and Fermenters not outputting Items automatically\n- fixed Silo not auto-outputting when supplied with a redstone signal\n- fixed Railgun not shooting alu, iron and steel sticks from other mods\n- fixed Manual on Railguns crashing without Railcraft installed (thanks Malte)",
        "0.10-49": "- rewrote the shader system\n    - improved texture performance\n    - changed API integration\n    - added listing in the manual, including re-ordering\n    - removed the recipe to turn shaders back into bags\n- added the ability to rename wooden crates\n- added IRotationAcceptor interface for dynamos and the things that drive them (thanks Malte)\n- re-added the config for Excavator fail chance (thanks Malte)\n- re-added the ability to dye balloons (thanks Malte)\n- re-added the ability to add shaders to balloons\n- changed the drill's hardness checks to easier dig ores (thanks Malte)\n- fixed duped fluidcontainers on treated wood recipes\n- fixed incompat issue with new versions of TConstruct\n- fixed CraftTweaker compat (thanks mezz)\n- fixed Crusher recipe for sand requiring grass rather than gravel (thanks MalkContent)\n- fixed NPE on inserting items\n- fixed Wirecutters consuming durability and not working properly on transformers\n- fixed various client issues (thanks Malte)\n- fixed Structural Connectors and Redstone Connectors not displaying properly (thanks Malte)\n- fixed Conveyors throwing NPEs on Servers (thanks Malte)\n- fixed dupebug with Charging Station\n- fixed a few missing sounds\n- fixed a concurrent modification in Tesla Coil sounds (thanks Malte)",
        "0.10-50": "- added versioncheck for TConstruct to prevent crashes with ranged weapons\n- added Icons for all IE machines to JEI and fixed recipe displays\n- fixed furnace heater constantly updating chunks\n- improved UV maps on the revolver, added a new shader",
        "0.10-51": "- re-added Festive Crates! Happy Holidays!\n- re-added Botania compat for shaders, Relic rarity lootbags + shaders\n- added the ability for Strip Curtains to emit redstone when an entity passes through\n- added compatability for Forge Energy / Forge Units. End of an era, I guess.\n- fixed a nullpointer on JumpCushions\n- fixed Splitting and Dropping Conveyor not inserting into inventories\n- fixed crashes in the manual due to incomplete tesselation\n- fixed load-cycle with TCon\n- fixed HarvestCraft recipes usign water/milk not working in the assembler\n- fixed Furnace Heater constantly updating the block when insufficiently powered\n- IE now has a Maven (thanks SkySom)",
        "0.10-52": "- added the ability for Dropping Conveyors to drop through trapdoors\n- added a new shader\n- fixed Nullpointer for Connectors accepting FUs",
        "0.10-53": "- added new shaders\n- fixed Sample Drill crashing upon energy insertion\n- fixed Tesla Coil crashing upon energy insertion\n- fixed Revolver rendering on Tiny Potatoes\n- fixed Refinery not allowing extraction\n- fixed achievement for crafting the Mining Drill not firing\n    - retro-actively firing crafting achievements when modifying them in the workbench\n- fixed Lightning Rod not building its fence-net properly\n- fixed bounds and disassembly of the Lightning Rod\n- fixed Splitting Conveyors sometimes not clearing temporary NBT data from entities\n- fixed a bit of log spam by invalid/missing models\n- fixed Blueprints not taking unstacked resources\n- fixed Vertical Conveyors not rendering walls on their base properly\n- fixed a dupebug with InventorySorter\n- fixed Fluids not updating to existing entries when failing to register",
        "0.10-54": "- added the Automated Engineer's Workbench, allowing automated handling of Blueprint Recipes\n- added the Turntable, a block that allows rotating of other blocks\n- added the \"Dominator\" shader\n- changed Wirecoils to change their distance display to red when too far from their linking point\n- changed Graphite Electrodes to stack to 16 to make them more viable as Railgun ammo\n- changed Assembler to allow crafting IC2 recipes (thanks Malte)\n- fixed issues with lowercasing without locale\n- fixed ThermoElectric Gens, Dynamos and Wire Connectors not handling Forge Energy\n- fixed Shaderbags having their conversion recipes crash\n- fixed duplicate rod recipes in the Metal Press\n- fixed TConstruct book not showing Hemp item\n- fixed multithreading issues (thanks Malte)\n- fixed crash with unknown recipes in the Assembler (thanks Malte)\n- fixed resource overhead with Bucket Wheel rendering (thanks Malte)\n- fixed Manual not handling scrolling lists properly\n- fixed Sheetmetal Tanks not rendering fluids with colour\n- fixed Chemthrower not dropping player-only items (Blazerods)\n- fixed Buckshot and Dragonsbreath having the wrong return cartridges and the wrong DamageSource\n- fixed needless chunkupdates caused by Blastfurnace Preheaters\n- fixed Splitting Conveyors flipping directions too early",
        "0.10-55": "- re-added the Bottling Machine! It bottles things up, like fluids and emotions!\n- added indicative scrollbars to the manual\n- added nullcheck to guard against malformed sound events\n- added a login check to synchronizing Excavator data\n- added a config option for hte drop weight of Hemp Seeds\n- changed IC2 compat to no longer load with IC2 classic\n- changed permission levels on comamnds to allow \"/cie resetrenders\" for everyone\n- fixed Minetweaker and JEI integration. Arc Furnace reduced to a single categroy, I'm afraid.\n- fixed Automatic Workbench using Pair from JavaFX\n- fixed null-master exceptions for Multiblocks\n- fixed rotations of wooden blocks (Gunpowder Barrel, Item Router)\n- fixed GUI of the Item Router\n- fixed SideOnly exceptions triggered by Chisel&Bits\n- fixed Withers dropping Lootbags. They really shouldn't anymore.\n- fixed world loading caused by connection persistence and validation (thanks Dogboy21)\n- fixed Crusher not collecting drops from low-health entities\n- fixed Assembler and Metal Press not reorienting conveyors when broken",
        "0.10-56": "- fixed duplication of stacks of items dropped onto the bottling machine\n- fixed EntityDataManager registration (thanks mconwa01)\n- fixed manual entry of the fluidpump citing the use of \"wirecutters\" instead of \"hammer\"\n- fixed manual typo in the fermenter entry",
        "0.10-57": "- added RazorWire! It pricks and slows, and you can electrify it.\n- added Fluid Concrete. Slows entities down and immobilizes them when it dries\n- added a Potion fluid. Effects vary on NBT data. Works in the Chemthrower, can be bottled in Bottling Machine.\n- added blocks for (almost) all IE Fluids\n- added the Mixer! It mixes solid components into fluids to make concrete or various potions!\n- added Turrets! Configurable targeting, currently allowing for fluids (Chemthrower) or bullets (Revolver) as ammo\n- changed Floodlights to allow inversion of redstone control\n- changed Charging Station to allow charging Forge Energy items as well\n- fixed Bottling Machine recipes not consuming fluid and duping items (thanks Malte)\n- fixed Redstone Wires illegally connecting to relays\n- fixed ArcFurnace recipes causing NPEs when added through Minetweaker\n- fixed JEI handler preventing Draconic Evolution for loading theirs\n- fixed OneProbe showing components of Multiblocks rather than the MB itself\n- fixed derped texture on Metal Press\n- fixed side-solidity for Stone Multiblocks\n- fixed the density of Creosote Oil. A certain Lemming notified me that it's in fact, denser than water.\n- Translations Added/Updated: ru_RU (lex1975)",
        "0.10-58": "- added the Fluid Router. It does exactly what the Item Router does, but for fluids.\n- added Crafttweaker integration for the Mixer\n- added the Garden Cloche! It grows a variety of crops!\n    - added farming compatability for Actually Additions\n    - added farming compatability for Attained Drops\n    - added farming compatability for Mystical Agriculture\n    - added farming compatability for Harvestcraft\n    - added farming compatability for Better With Mods\n    - added farming compatability for Extra Utils\n- added Chemthrower compatability for ThermalFoundation fluids\n- added carpet, quarter and threequarter thicknesses for Concrete to make the fluid dry to more reasonable levels\n- added a toggleable option to the Mixer to output all fluids instead of just the bottom one\n- added placeable Toolboxes, they are fully accessible while placed\n- added placeable Coresamples, these can be rightclicked with a map to set a marker to their origin\n- added a visible chunk boundary when holding or looking at the Sample Drill\n- added Redstone Wires to the API (thanks Malte)\n- added a render reset hook to the API (thanks Malte)\n- added the Covered Conveyor, preventing players from picking up items from it\n- added a Conveyor unaffected by redstone\n- added the Fluid Outlet. It puts fluids in the world!\n- added OC compat for Mixer and BottlingMachine (thanks GuyRunningSouth)\n- added a Villager Job to sell Shader Bags\n- added a Crusher recipe to turn slag into sand\n- added a special ItemFrame render for Blueprints\n- added the ability to flip Powered Lanterns using the hammer\n- added the option for Strip Curtains to output a strong RS signal\n- added a sound to the Breaker Switch - Clearly the best feature of this update\n- changed Razorwire to render extended wooden boards when stacked\n- changed the Conductive debuff to apply to Teslacoil and Electro-Razorwire damage\n- changed metal plates and Sheetmetal to be craftable for any IE-used metal\n- changed Crafttweaker functions for Squeezer and Fermenter to feature input-based removal\n- changed dropping Conveyors to use Iron Trapdoors rather than Hoppers in the recipe\n- changed fluid potions to have reduced durations in the chemthrower\n- fixed Concrete blocks not applying suffocation damage\n- fixed some cartridges being allowed in turrets, fixes crash with Immersive Floofs\n- fixed energy drain on eletrified bullets, reduced drain for multii-projectile cartridges\n- fixed ownerless, tameable entities causing crashes in Turret targeting\n- fixed item in- and outputs on Turrets being unavailable\n- fixed manual entry for Razorwire\n- fixed NullPointer on FluidStacks\n- fixed Turntables and Hammers being able to rotate extended pistons, chests, beds, end portals and skulls\n- fixed the Drill taking more damage than intended (thanks Malte)\n- fixed the display of double arrays in the manual (thanks Malte)\n- fixed lang file as per suggestions on github\n- fixed Balloons and Redstone Connectors being invisible in the End\n- fixed Chemthrower projectiles being set on fire even when the fluid isn't flammable\n- fixed invalid connections being made possible due to splitting stacks (thanks Malte)\n- fixed bounding boxes and wire offsets for transformers (thanks Malte)\n- fixed transformers mistakenly having TESRs and accepting LV+MV wires in combination (thanks Malte)\n- fixed the Potion fluid not having textures (thanks Malte)\n- fixed ConcurrentModificationException on Crafttweaker reloads (thanks Malte)\n- fixed the Mixer not working when its internal tank is filled (thanks Malte)\n- fixed IE slag not being usable in ThermalExpansion recipes\n- fixed the Turrets losing its inventory (thanks Malte)\n- fixed NBT sensitive fluids not outputting from barrels properly (thanks Malte)\n- fixed a dupebug of empty fluid containers in the Assembler\n- fixed Assembler outputting damageable craftign items\n- fixed missing sounds on IE explosions\n- fixed Refinery dividing by 0 if timer config is adjusted downwards\n- fixed AutoWorkbench not exposing the right slots to its item handler and rendering the wrong items\n- fixed projectiles ignoring PvP protection within player teams\n- fixed wires not being removed properly if TileDrops are off (thanks Malte)\n- fixed floating Engineer's houses\n- fixed broken Energy Storage tooltips\n- fixed Metal Press not dropping its mold when broken\n- fixed various double-size blocks deleting things above them\n- fixed stuttering on Metal Press and Watermill (thanks Malte)\n- fixed Relays connecting to energy accepting things, to make their role more obvious (thanks Malte)\n- fixed resource reloading on TESRs (thanks Malte)\n- fixed various Turret projectile issues (thanks Malte)\n- fixed a Blast Furnace processing speed bug (thanks Malte)\n- fixed Skyhook being a stupidly powerful weapon (thanks Malte)\n- fixed the Crusher outputting to the wrong side\n- Translations Added/Updated: ru_RU (lex1975) (this time for real, since I forgot it last time), zh_TW (xaxa123)"
    },
    "1.11.2": {
        "0.11-62": "- official 1.11.2 release, same changelog as build 59",
        "0.11-63": "- added the Heavy Plated Shield!\n    - it protects like a normal shield\n    - it has awesome upgrades\n- added Vacuum Tubes as a new mid-game crafting material\n- added a manual entry for the new components\n- added Crafttweaker integration for Blueprint recipes\n- changed/fixed HUD displays for Railgun, Chemthrower and Revolver\n- changed Turrets to be interactable from the top block (thanks Malte)\n- changed Arc Furance to distribute inputs evenly again (thanks Malte)\n- changed Sulfur and Saltpeter textures to be Hazards instead of my terrible ones\n- changed recipes for Mechanical components, added Bluepritns for reduced cost\n- changed JEI integration to use newer JEI methods\n- changed Engineer's Workbench to no longer be part of IE's main achievement progression\n- fixed Redstone connectors not properly accepting signals (thanks Malte)\n- fixed OC compat not loading due to incorrect mod ID (thanks Malte)\n- fixed Capacitor Backpack potentially charging itself\n- fixed crashes with Capacitor Backpack and Railgun interacting with capabilities (thanks Malte)\n- fixed localization file getting screwed up to ASCII\n- fixed up interacton between Silos and RefinedStorage (thanks Malte)\n- fixed ghostloading messing up randomizers for a lot of stuff (thanks Malte)\n- fixed a plethora of ghostloading issues (thanks Malte)\n- fixed Capacitor Backpacks being all-around derpy when crafting (thanks Malte)\n- fixed broken Pipe renders (thanks Malte)\n- fixed Turntable not reacting to redstone signals\n- fixed Fluid Outlet outputtign through closed sides\n- fixed render issues with the charging station (thanks Malte)\n- fixed (possibly) Wooden Crates in villages losing their contents on pickup"
    },
    "1.12.2": {
        "0.12-64": "- Updated to Minecraft 1.12, fixed a lot of the issues resulting from this update\n    - NOTE: Currently, IE's vanilla crafting recipes are not yet JSONs. This will probably change in future releases.\n    - NOTE ALSO: Update may be a bit unstable. Feel free to report issues on github.\n- added Advancements to replace Achievements, some even give rewards!\n- added a custom trigger to detect formation of multiblocks\n- added two new Shaders: WAAAGH! and Lusus Naturae\n- added a super fancy spinning animation to Revolvers that use a specific skin.\n    - atm limited to two exclusive skins, may be expanded in future.\n- changed holding animations for Revolver, Drill, Chemthrower and Railgun\n    - has a config option in case it conflicts with other animation mods\n- changed certain Mineral Veins to output Sulfur Dust\n- changed OneProbe integration a tiny bit, showing SideConfigs on Barrels, Capacitors, etc.\n- fixed Minecart shaders crashing with layer counts over the default",
        "0.12-65": "- changed crafting recipes to the new json based system!\n- fixed ClientProxy trying to subscribe on the Server side\n- fixed arm sleeves on players not matching arm position. Nothing I can do about armor, I'm afraid.",
        "0.12-66": "- fixed the missing dustCharcoal reference in recipes",
        "0.12-67": "- added the Probe Connector. It can read Comparator Overrides on Inventories and stuff!\n- added fancy animations for the reload with a speeloader and opening the revolver GUI\n- added the Circuit Board material, requires for Probe Connector and Turrets\n- added Comparator interfacing to a lot of IE multiblocks (using the RS controlpanel)\n- re-added animations for the drill. It rotates again \\o/\n- changed TE OreDict comapt to run in init phase\n- changed Revolvers to aim at enemies properly\n- changed re-equip animations for Revolver to look better\n- changed the Speedloader to a separate item, added a unique reload sound\n- changed the link system in the manual to allow linking to specific crafting recipes\n- fixed missing recipes for Metal plates\n- fixed Uranium Blocks + Slabs not having a recipe\n- fixed IE's fluids to always stitch into the sheet and have buckets load correctly\n- fixed missing Hammer Crushing recipes\n- fixed IE recipes using fluids not emptying containers properly & duplicating them\n- fixed recipes for Aluminium and Steel wires",
        "0.12-68": "- re-added TConstruct compat\n- added Fertilizer compat for ActuallyAdditions, BetterWithMods and IC2\n- changed player arms for certain IE items to also affect armor\n- changed shield to use Forge's new provided shield method\n- changed Mystical Agriculture compat to not output seeds anymore\n- changed Arc Furnace, Squeezer and Fermenter to only output comparator signals for their input\n- changed revolver GUI to allow display of dual-wielded revolvers\n- fixed cloche not accepting power from the bottom block\n- fixed speedloader recipe mistakenly crafting a revolver\n- fixed gunpowder recipe being active even when there isn't any charcoal dust\n- fixed shield only equipping on the clientside with the magnet glove\n- fixed shield flickering when recharging in offhand\n- fixed back button in the manual failing\n- fixed shaders resulting in invisible revolver grips\n- fixed crafttweaker integration\n- fixed various AABBs errors causign projectiles to miss\n- fixed cloche having incorrect item handling (leading to trouble with EIO conduits)\n- fixed Forestry compat not loading\n- fixed Fluid Router allowing for an infinite loop\n- fixed Assembler not handling some recipes properly",
        "0.12-69": "- fixed TConstruct dependency\n- fixed Assembler not properly handling Fluid Ingredients from IE and CoFH\n- fixed Revolver GUI not properly syncing\n- fixed model loading error (thanks PaleoCrafter)",
        "0.12-70": "- added Shader-capabilities to the Heavy Plated Shield\n- added Scaffolding Slabs and Stairs\n- added a tiny bit of Albedo compat. Makes fancy lights happen on the Tesla Coils!\n- changed Mystical Agriculture compat to work for Inferium seeds\n- changed bullets to have increased speed\n- changed HE cartridges to travel in an arc and make a different sound\n    - API update, cartridges can define custom sounds\n- changed, updated and improved the CTM compatability (thanks InsomniaKitten)\n- fixed Treated Wood recipes not consuming creosote\n- fixed up fence-connections for some IE blocks\n- fixed duplication glitch within the Refinery\n- fixed particle issues with some Multiblocks",
        "0.12-71": "- added missing recipes for Scaffold Slabs & Stairs\n- added Albedo compat for Flare Cartridges\n- added a recipe to make torches out of wool and creosote\n- added the \"Ancient\" shader\n- added the Covered Vertical Conveyor\n- added the Chemthrower Multitank upgrade\n- re-added the Hemp to String recipe\n- changed logging to use separate logger rather than FMLLog (thanks Malte)\n- changed Garden Coche to allow Podzol as a mushroom soil\n- changed the Cloche to run at a reduced speed\n- changed all multi- and dummyblocks to be immovable by Pistons, because Quark\n- fixed Core Sample Drill animation (thanks Malte)\n- fixed a bunch of Capability errors (thanks Malte)\n- fixed turrets causing issues in target acquisition (thanks Malte)\n- fixed client disconnecting due to NBT overflow in crates and toolboxes (thanks Malte)\n- fixed broken remapper (thanks Malte)\n- fixed conveyor recipes requiring single inputs (thanks Malte)\n- fixed Tesla Coil animation not getting reset (thanks Malte)\n- fixed Chisel compat conflicting with CTM\n- fixed HarvestCraft compat not handling water and milk in the assembler properly\n- fixed auto-breakers causing issues with Storage Crates and others\n- fixed shiftclicking being broken in the Cloche GUI\n- fixed Manual not reopening on the selected page\n- fixed Railgun not working on Ender Dragon, Crystals and non-living entities (thanks Malte)\n- fixed Bullets not loading the damage from the config properly\n- fixed deprecated uses of getDrops\n- fixed Splitting Conveyor being derpy after being rotated",
        "0.12-72": "- added a recipe to fill the Speedloader in a crafting table\n- added Packing and Unpacking molds to the Metal Press\n- added Jar Signing to comply with Forge's coremod guidelines (thanks Malte)\n- added support for amounts on OreDict ingredients in Crafttweaker compat (thanks MatrixN1)\n- added Crafttweaker compat for the Dieselgenerator + Drill (thanks Faxn)\n- changed IE's items with internal storage to use ItemHandler capabilities (thanks Malte)\n- changed IE's OBJ models to generate less comparative objects (thanks Malte)\n- changed IE to register its recipes on the proper event, fixing Crafttweaker compat\n- changed Alloy Kiln and Blastfurnace to tick down their active fuel even when not smelting (like vanilla furnaces)\n- changed Pumpkin and Melon seeds to have reduce oil outputs, and reduced their growthrate\n- changed Metal Press molds to be crafted in the Workbench\n- changed Metal Barrels to not output fluid when receiving a redstone signal, to work as valves (thanks Berinhardt)\n- changed dummies on Multiblocks to be removed from the list of ticking tiles (thanks Malte)\n- changed Windmills to rotate in in accordance to wind from the north or west, rather than fixed clockwise\n- fixed issues with dummyblocks spawning outside world borders (thanks Malte)\n- fixed crates and toolboxes losing their inventory (thanks Malte)\n- fixed various desync issues with the Engineer's Workbench (thanks Malte)\n- fixed render issues with multiblock TESRs (thanks Malte)\n- fixed Botania compat\n- fixed various desync issues with the Revolver & Speedloader HUD displays (thanks Malte)\n- fixed Multiblocks not dropping their contents\n- fixed Diesel Generators not allowing levers to be attached\n- fixed tooltip localisation for Alloy Kiln and Automatic Workbench\n- fixed Stripcurtains not notifying the strong signal to turn off\n- fixed Railgun projectiles not colliding with entities properly\n- fixed Fluid Pipes not showing their covers with CTM installed\n- fixed inventory models for Engineering blocks with CTM installed",
        "0.12-73": "- added whitelist configs for the toolbox\n- re-enabled WAILA compat\n- re-enabled OpenComputers compat (not sure if it works)\n- changed IE to load on all 1.12 subversions\n- changed Metal Press render to have items sink a bit down to hide blocks\n- changed IE blocks to allow states for directional setting (thanks Malte)\n- changed Crushers to have a limited size queue to avoid login crashes\n- fixed toolbox crashing when placed (thanks Malte)\n- fixed lighting of the chemthrower particles (thanks Malte)\n- fixed drill and revolver looking derpy when fancy animations are disabled\n- fixed the MilÃ³ Shader's name (thanks Malte)\n- fixed client-access exceptions with TOP handler\n- fixed Foresty compat errors\n- fixed cycle animations for the gunturret\n- fixed issues with Botania compat",
        "0.12-74": "- changed IE to ACTUALLY load on all 1.12 subversions",
        "0.12-75": "- Relicensed IE, because it was about time. It's not perfect but it's better than uncertainty\n- added a basic description to the mcmodinfo (thanks carstorm)\n- added a configurable, global, modifier for the Cloche's Fertilizer effectiveness\n- cleaned up internal BlockState logic a bit (thanks Malte)\n- changed Chisel compat to use proper IMC keys\n- changed Stone Multiblocks to be immovable to pistons\n- changed RedtoneBreakers to not visually connect to non-direct redstonedust\n- fixed broken rendering for blocks in non-standard layers (thanks Malte)\n- fixed config checks for @Mapped values causing issues (thanks Malte)\n- fixed issues with invalid block rotations (thanks Malte)\n- fixed Autoworkbench not disassembling properly (thanks Malte)\n- fixed crashes caused by empty ItemStacks (thanks Malte)\n- fixed Multiblocks not firing visual updates properly (thanks Malte)\n- fixed Eletrode Blueprints not being craftable\n- fixed Fluid Pump and Sheetmetal Tank not preserving NBT data\n- fixed Storage Crates writing empty enchantment tags on pickup\n- fixed Wire connections not synchronizing properly when switching between worlds (thanks Malte)\n- fixed Assembler consuming too much fluid in edgecases (thanks Malte)\n- fixed desync issues with the Workbench in multiplayer (thanks Malte)\n- fixed waterwheel rotation issues (thanks Malte)\n- fixed shooting non-living entities with the Chemthrower (thanks Malte)\n- fixed Mixer recpies not showing tooltips in JEI\n- fixed Cloche voiding seeds",
        "0.12-76": "- added various config options for the Belljar, to adjust growthspeeds and fertilizer effects\n- re-added partivles and animation for the Arc Furnace (thanks Malte)\n- added TOP compat for the Sheetmetal Tank (thanks SirWindfield)\n- added Metal Ladders and Scaffold covered versions \n- fixed wires connected to razorwire not rendering (thanks Malte)\n- fixed missing comparator output on the Current Transformer (thanks Malte)\n- fixed the drill accidentally modifying its NBT on sharing (thanks Malte)\n- fixed the Bucket Wheel having rotation issues (thanks Malte)\n- fixed crashes related to newer Forge versions (thanks Malte)\n- fixed rendering issues with the Floodlight and improved its performance (thanks Malte)\n- fixed Carrots and Potoes not working in the Cloche (thanks SirWindfield)\n- fixed crash when the Teslacoil destroys a piece of Faraday armor\n- fixed Chisel compat\n- fixed AA compat, Canola in the squeezer\n- fixed TCon compat, mixup of Constantan and Uranium (thanks tgstyle)\n- fixed TCon compat, Arc Furnace for alloying\n- fixed a crash with the Slippery potion\n- fixed derpyness with Mineral Veins (at least for the most part), regarding CraftTweaker\n- fixed links to Biodiesel in the manual pointing to a nonexistant page\n- fixed a minor texture warning in the console\n- Translations Added/Updated: zh_CN (DYColdWind)",
        "0.12-77": "- Various changes to the wiring system (Malte):\n  - Uninsulated energy wires cause damage now\n  - Wires don't need clear line-of-sight but a clear path along the wire as it is rendered\n  - Placing blocks that obstruct wires will cause the wire to break/drop\n  - The skyhook can attach to the middle of connections, rather than just the endpoints\n  - Added a feedthrough insulator as a way to get wires through walls\n  - Addons using wires will have to adapt to these changes!\n- IE now prints a message to chat if Java 8 update 25 is used since it causes unfixable crashes (Malte)\n- Changed Drill to have the \"Shovel\" tool class (primetoxinz)\n- Changed Excavator to show Cobblestone instead of missing texture when digging items instead of blocks (BluSunrize)\n- Fixed the drill not properly accepting its head (Malte)\n- Fixed broken deserialization of boolean properties, this caused some potential issues with Buildcraft (Malte)\n- Fixed some TESR blockstate crashes (Malte)\n- Fixed IE projectiles (chemthrower, railgun) not working (Malte)\n- Fixed wire loss being higher than intended in some cases (Malte)\n- Fixed fluid pipes losing fluid and not accepting small amounts (Malte)\n- Non-IE wires can no longer be connected to IE connectors (Malte)\n- Fixed arc furnace particles rendering when the arc furnace isn't active (Malte)\n- Fixed some capability crashes (Malte)\n- Fixed mobs trying to jump over IE fences (Malte)\n- Re-fixed the blast furnace using slightly more coke coal than it should (Malte)\n- Fixed Vertical Conveyor recipes returning too little (BluSunrize)\n- Fixed Nullpointer on Redstone Probes (BluSunrize)\n- Fixed Output slots not being blocked (BluSunrize)\n- Translations Added/Updated: en_ud (The-Fireplace), ja_jp (iceink001)",
        "0.12-78": "- Added a preliminary connection render to debug obstructions (Malte)\n- Added Craftweaker function to remove Crusher recipes by input (BluSurize)\n- Fixed crash when breaking middle block of Feedthrough connector (Malte)\n- Fixed errors related to floating point accuracy (Malte)\n- Fixed Blastfurnace not working at all (Malte)\n- Fixed raytracing on vertical connections (Malte)\n- Fixed Sampledrill render (Malte)\n- Fixed J8U25 message showing on dimension change (Malte)\n- Fixed Feedthrough connectors connecting to themselves (Malte)\n- Fixed wires dropping in the wrong location (Malte)",
        "0.12-79": "- Added the ability for Wirecutters to cut wires from anywhere (Malte)\n- Added Craftweaker support for the Thermolelectric Generator (BluSunrize)\n- Added documentation for metal ladders (BluSunrize)\n- Added Squeezer recipe for beetroot seeds (pap1723)\n- Re-Enabled OpenComputers compat (Malte)\n- Changed Feedthrough Connectors to break like normal multiblocks (Malte)\n- Changed Feedthrough Connectors to form regardless of connector face clicked (BluSunrize)\n- Changed codebase for wire coils to allow easier extension (AntiBlueQuirk)\n- Changed Multiblocks to only move FluidContainers to the output slots when they are full (BluSunrize)\n- Made the IE config react to changes from the in-game GUI\n- Fixed a crash with Optifine and feedthrough connectors (Malte)\n- Fixed wire rendering in edgecases (Malte)\n- Fixed issues with the Skyhook (Malte)\n- Fixed missing textures on conveyors (Malte)\n- Fixed dupebug with Jerrycans (Malte)\n- Fixed stackoverflow with routers (Malte)\n- Fixed Feedthrough Connectors functionality (Malte)\n- Fixed Coresamples not dropping when broken (Malte)\n- Fixed missing revolver sounds (BluSunrize)\n- Fixed broken audio-subtitles (lgthibault)\n- Fixed crash with windmills (lgthibault)\n- Fixed crash with metal ladders (lgthibault)\n- Fixed Craftweaker removal function of MetalPress (BluSunrize)\n- Translations Added/Updated: ja_jp (iceink001), zh_CN (DYColdWind)",
        "0.12-80": "- Fixed multiblock rendering in the manual with Optifine and texture packs (Malte)\n- Fixed pre-IE-79 multiblocks not working on IE 79 (Malte)\n- Fixed FluidContainer slots not accepting empty containers (BluSunrize)\n- Fixed Villager trades for Shader bags being inverted (BluSunrize)\n- Fixed Multiblocks dropping themselves as illegal items (BluSunrize)\n- Fixed ugly high-rez textures on Engineering blocks when CTM isn't loaded (BluSunrize)\n- Translations Added/Updated: ja_jp (iceink001), zh_CN (DYColdWind)",
        "0.12-81": "- Added the functionality for the Faraday Suit to protect against live wiring (Malte)\n- Added the ability to use Pick Block to take a connector's wire by sneaking (BluSunrize)\n- Added Magma blocks to the list of heatsources for the Thermoelectric generator (BluSunrize)\n- Added Efficiency, Unbreaking and Mending enchantments to the Engineer's Hammer and Wirecutter (BluSunrize)\n    - Made those tools take damage when used to break blocks\n- Added compatibility for Forge's update checker (Malte)\n- Added support for Forge's memory Maven repo, this makes deleting old coremod versions unnecessary in Forge 2656+ (latest) (Malte)\n- Changed fences to allow torches on top and prevent mobspawns (Malte)\n- Changed animated item models to use Item-TESRs rather than rebaking (Malte)\n    - Made the Fluorescent tube to be really fancy again! (Malte)\n- Changed renderdistance config to work as described (Malte)\n- Changed the images of wiring in the manual to use up-to-date pictures and feature connectors and relays (BluSunrize)\n- Shift-clicking is no longer needed to connect wires to breaker switches etc (Malte)\n- Failed wire connection attempts no longer spam the chat (Malte)\n- Changed Thermoelectric generator to cache its output values, improving performance (BluSunrize)\n- Fixed wires being invisible when logging into a server for the first time (Malte)\n- Fixed localization for treated wood banners (Malte)\n- Fixed the mineral command not workign with Vein names that contain a space (Malte)\n- Fixed shield having a really trippy enchantment glow (Malte)\n- Fixed conveyor recipe (Malte)\n- Fixed Skyhook crashing servers (Malte)\n- Fixed lag with redstone connectors (Malte)\n- Fixed blocks somtimes taking longer to break with the hammer (Malte)\n- Fixed a divide-by-zero issue in the ExcavatorHandler for blacklisted dimensions (BluSunrize)",
        "0.12-82": "- Added compat for farming Hemp to ActuallyAddition's farmer (BluSunrize)\n- Fixed Wirecutter getting consumed when cutting plates (BluSunrize)\n- Fixed Alloy Kiln consuming fuelsource container items (BluSunrize)\n- Fixed uncovered FluidPipes allowing mobspawns (BluSunrize)\n- Fixed spawn interdictors (Electric Lanterns, etc) not being removed on chunk unload (codewarrior0)\n- Fixed Metal Press animations and sounds with customized recipe times (codewarrior0)\n- Fixed some potential crashes in networking and reduced packet size (JamiesWhiteShirt)\n- Fixed 'removeRecipesForInput' in Crusher Craftweaker compat not working (BluSunrize)\n- Reduced the amount of ItemStacks being copied in rendering and recipe checking (Malte)\n- Translations Added/Updated: ja_jp (iceink001), zh_CN (DYColdWind)",
        "0.12-83": "- Added the Extracting Conveyor. It pulls from inventories like a Hopper (BluSunrize)\n- Added even fancier Shaders with pulsing colours and dynamic rendering. Quite open for addon devs, too! (BluSunrize)\n    - Added the IKELOS shader to make use of this\n- Added maps to the vanilla Catographer which lead to Mineral Veins (BluSunrize)\n- Added a config option to disable all use of the stencil buffer for old Intel GPUs (Malte)\n- Added normal tools (Axe, Pick, Shovel, Sword) made from Steel and Treated Wood. Good durability & efficiency, iron harvest level (BluSunrize)\n- Added a new rarity, \"Masterwork\". Currently only for Shaders (grabbags gained from secret advancements) but will have more use in the future! (BluSunrize)\n- Changed ItemRouters to allow pulling as well, allowing for filtered extraction (BluSunrize)\n- Changed BlastFurnace to not start using a new piece of coke if there is nothing left to smelt (Malte)\n- Changed the Excavator's Mineral Veins to consider the chunks in a radius of two around them, to avoid duplicate veins (BluSunrize)\n- Changed Chemical Thrower to factor in player-momentum to projectiles (TeamSpen210)\n- Fixed wires sometimes leaving behind the damage sources when broken (Malte)\n- Fixed the TConstruct compat module failing (Malte)\n- Fixed Hammers and Wirecutters to be properly repairable (Malte)\n- Fixed Wirecutters to be enchantable (Malte)\n- Fixed texture and model errors being spammed (Malte)\n- Fixed dropping conveyor spawning countless fake items in certain setups (Malte)\n- Fixed conveyors causing infinite loops in rare cases (Malte)\n- Fixed a crash when breaking a connector after dying (Malte)\n- Fixed wires connected to transformers breaking when they shouldn't (Malte)\n- Fixed horizotal wires on the breaker switch (Malte)\n- Fixed crashes with the Core Sample Drill in some dimensions (Malte)\n- Fixed pipes accessing the world from wrong threads (Malte)\n- Fixed a dupe bug (Malte)\n- Fixed the skyhook for vertical wires (Malte)\n- Fixed placing blocks against pipes not working as expected (Malte)\n- Fixed the garden cloche accepting any item into the fertilizer slot (Malte)\n- Fixed the workbench creating excess items (codewarrior0)\n- Fixed obstructed connections not rendering properly in LAN worlds (JamiesWhiteShirt)\n- Fixed Razor Wire not having collision on upper wall section (TeamSpen210)\n- Fixed Arc Furnace recycling being broken (BluSunrize)\n- Fixed Squeezer and Fermenter not updating the GUI when filling buckets (BluSunrize)\n- Improved log output when a compat module fails (Malte)\n- Translations Added/Updated: ja_jp (iceink001), ru_ru (kellixon ), zh_tw (vongola12324)",
        "0.12-84": "- Changed handling of Potions in the mixer: (BluSunrize)\n    - Now supports MixPredicates as well as custom brewing recipes\n    - Shows properly in JEI, based on Potion output, rather than input\n    - Bottling recipes are consistent, anything you can mix, you can bottle (ideally)\n    - Added tooltips to Potion fluids to show which mod added the PotionType\n    - Added compat for KnightMiner's Inspirations, allowing their Splash and Lingering bottles to be filled\n- Added a separate JEI Handler for Arc-Recycling (BluSunrize)\n- Added a particle trail to Minecarts that use fancy shaders (e.g. IKELOS) (BluSunrize)\n- Added the ability to pop Balloons by hitting them with a Projectile (BluSunrize)\n- Added Shader Particles to the Railgun and Drill (BluSunrize)\n- Added a \"Noise\" component to the revolver, which will make it attract nearby mobs when fired (BluSunrize)\n    - Adding a bit of a stealth/survival aspect\n    - Probably not super impactful in normal singleplayer, but could be fun for pack makers\n    - This will play into a larger customization system for the Revolver, to be implemented in the future\n- Re-Added some shader textures that got lost in the 1.11 update (BluSunrize)\n- Changed Arc-Recycling to run in init and be overall cleaner (Malte)\n- Changed the recipe for Vacuum Tubes to use Nickel Plates (BluSunrize)\n- Fixed compatability with ActuallyAdditions and AttainedDrops (Shadows-of-Fire)\n- Fixed out-of-thread call to JEI functions causing crashes (BluSunrize)\n- Fixed depth-rendering issues in JEI handlers (BluSunrize)\n- Fixed shiftclicking on IE's containers (BluSunrize)\n- Translations Added/Updated: zh_cn (DYColdWind)",
        "0.12-85": "- Re-Added Thaumcraft compat (BluSunrize)\n    - Added hammering of plates for Brass, Thaumium and Void Metal \n    - Golems can farm hemp\n    - Purifying Fluid and Liquid Death work in the Chemthrower\n    - Made the External Heater work with the Essentia Smelter\n- Added a tooltip-display to Speedloaders and Revolvers to display their currently loaded ammo (BluSunrize)\n- Re-Added the \"Super Secret BluPrintz\" easteregg (BluSunrize)\n- Added the ability to use the Capacitor Backpack as a Bauble (BluSunrize) \n- Fixed up the skyhook, including one crash (Malte)\n- Fixed some rare crashes when closing a world (Malte)\n- Fixed redstone connectors not closing doors using weak signals (Malte)\n- Fixed the mixer crashing if the recipe is trying to process too much fluid (Malte)\n- Fixed Machinist selling iron and steel drills in the wrong order (BluSunrize)\n- Fixed balloon colouring on dedicated servers (Malte)\n- Fixed a dupe bug (Malte)\n- Fixed a crash involving metal ladders (Malte)\n- Fixed Crafttweaker Integration to allow removing Potion mixing recipes  (BluSunrize)\n- Fixed an edgecase crash with Cartographer Maps (BluSunrize)\n- Fixed ArcFurnace requiring additional inputs to start a recipe (BluSunrize)\n- Fixed upgrades vanishing in the Workbench (Malte)\n- Fixed Lightningrod not playing nice with other mods' energy transport (BluSunrize)",
        "0.12-86": "- Added support for JEI ghost ingredients to the assembler and routers (Malte)\n- Re-Added razor wires hurting players trying to break them without wirecutters (Malte)\n- Re-Added coloured pipes (Malte)\n- Re-Added structural arms (Malte)\n- Added clickable areas for JEI to the IE machine GUIs (TeamSpen210)\n- Added the ability to apply Shaders to banners! (BluSunrize)\n- Added a Silt vein for the Excavator, contains clay, sand and gravel (BluSunrize)\n- Removed the additional http request for the changelog in the manual (Malte)\n- Changed Mixer to allow the use of other mods' sheetmetal in its construction (tgstyle)\n- Changed the way wire & connector models work internally (Malte)\n- Feedthrough insulators can now be formed while wires are attached to the connectors (Malte)\n- Fixed arc recycling calculations failing in rare cases (Malte)\n- Fixed lag with certain setups of routers (Malte)\n- Fixed conveyors sometimes showing the wrong model (Malte)\n- Fixed crashes with recent Forge versions (Malte)\n- Fixed the arc furnace not recycling damaged tools (BluSunrize)\n- Fixed a crash with recent Forge versions (Malte)\n- Fixed Wooden Posts connecting to Vines (BluSunrize)\n- Translations Added/Updated: ru_ru (gri3229), ko_kr (mindy15963)",
        "0.12-87": "- Added a \"Distribute Inputs\" button to the ArcFurnace GUI. It keeps splitting the biggest stacks in the input if there is space available (BluSunrize)\n- Added the Maintenance Kit, an on-the-go option to modify tools, like changing drillheads or configuring the Ear Defenders (BluSunrize)\n- Changed the skyhook in multiple ways (Malte)\n  - The speed now depends on gravity\n  - The skyhook will not drag players into blocks any more\n  - Many other smaller changes\n- Changed connectors to accept multiple \"bursts\" of energy if they (in total) don't exceed the max IO rate (Malte)\n- Changed internal logic of the Assembler to be a lot more straightforward, allowing bucket-like items for fluid ingredients (BluSunrize)\n- Changed the Engineer's Workbench around (BluSunrize)\n    - Lots of internal fixes to improve reliability and performance, as well as code style\n    - Fancy new render features, showing the blueprints on the table and the ingredients being used\n- Changed Fluid Pipes to no longer automatically connect to pipes that have been dyed a different colour (BluSunrize)\n- Changed recipe for Revolver Barrel to be (hopefully) less conflicting (BluSunrize)\n- Changed Excavator to work over void (BluSunrize)\n- Removed clickable JEI areas from the Assembler because they were blocking the output slots and were unnecessary anyway (BluSunrize)\n- Fixed wires not showing particles when burning (Malte)\n- Fixed recipes for structural arms conflicting with stairs (Malte)\n- Fixed structural arms being invisible due to a conflict with CTM (Malte)\n- Fixed minor issues where certain enemy network setups made powered lanterns flicker (Malte)\n- Fixed Dragon's Breath shader using hte wrong description in the manual (BluSunrize)\n- Fixed connectors not rendering as part of manual multiblock previews (Malte)\n- Fixed Ingredient Recipe not transposing the index correctly, causing loss of items (BluSunrize)\n- Fixed Item Router voiding items when used to extract (BluSunrize)\n- Fixed an annoying consolespam with the Cartographer trades (BluSunrize)\n- Fixed various GUIs still using \"RF\" instead of \"IF\" (BluSunrize)\n- Fixed Lightningrod resulting in a crash on very specific setups (BluSunrize)\n- Fixed dupebug with ArcFurnace recycling (BluSunrize)\n- Fixed the Garden Cloche accepting Fluids it can't work with (BluSunrize)\n- Fixed connectors duping small amounts of energy (Malte)\n- Fixed lighting on capacitors (Malte)\n- Fixed excessive render latency in JEI (Malte)\n- Fixed OpenComputers integration (sargunv)\n- Fixed Covered Extracting Conveyor not applying magnet protection (BluSunrize)\n- Translations Added/Updated: ja_jp (karakufire), es_es(Dorzar & rogama25), zh_cn (mcBegins2Snow)",
        "0.12-88": "- Changed Multiblocks to accept redstone-ignoring conveyors as well as default ones. They will revert to normal ones when the multiblock is broken. (BluSunrize)\n- Fixed crashes when opening a toolbox or a revolver GUI (Malte)\n- Fixed side solidity on conveyors, prevents snow on places it shouldn't be (BluSunrize)",
        "0.12-89": "- Added a covered dropping conveyor (BluSunrize)\n- Added recipes to break down Clay blocks (crusher) and Melon blocks (unpacking mold) (BluSunrize)\n- Added Cinnabar vein, containing Redstone, Cinnabar, Ruby and Sulfur (BluSunrize)\n- Changed Config to feature range values (Malte)\n- Changed Compat Modules to register recipes on the registry event (BluSunrize)\n- Fixed crash when placing blocks that shouldn't be used as a grid on lightning rods (Malte)\n- Fixed Balloon shaders (Malte)\n- Fixed Steel Axe having overly high damage (BluSunrize)\n- Fixed potential crashes related to the new blueprint renders (BluSunrize)\n- Fixed coresample markers disappearing off maps after restarting (BluSunrize)\n- Fixed snow collecting on partial concrete blocks (Voidi)\n- Fixed Extracting Conveyors not resetting their cooldowns when toggled by redstone (MalkContent)\n- Translations Added/Updated: pt_br (chico3434), es_es(rogama25), zh_cn (mcBegins2Snow)"
    }
}