{
  "0.14-93": "- Initial alpha release for Minecraft 1.14.4",
  "0.14-94": "- Added Minecarts!\n    - Wooden crates, reinforced crates, wooden barrels and metal barrels can be put in carts\n    - IE's conveyors can load and unload (extracting conveyor) Minecarts (including vanilla ones!)\n- Re-Added Steel Armor\n- Added vanilla recycling (1 nugget!) for steel tools, steel armor and the faraday suit\n- Change minimum Forge version to 28.2.3\n- Fixed crash due to Minecart render\n- Fixed various rendering glitches\n- Fixed buckets not working\n- Fixed cloche and other dummy-constructed blocks replacing existing blocks\n- Fixed links in the manual's search function\n- Fixed extracting conveyors not being able to rotate their input points\n- Fixed missing vanilla materials in excavator minerals",
  "0.14-95": "- Added the Buzzsaw! It cuts Trees! (BluSunrize)\n- Added full support for the new Villages! (BluSunrize)\n    - Different houses based on biome\n    - 5 different IE Villagers and their workstations:\n        - Structural Engineer, using the new Engineer's Crafting Table\n        - Machinist, using an Anvil\n        - Electrician, using a Current Transformer\n        - Gunsmith, using the Engineer's Workbench\n        - Outfitter, using IE's Shader Banner\n    - All IE villagers vary their outfit based on profession and biome \n- Re-Added Revolver Perks (BluSunrize)\n- Re-Added the Fluid Outlet (Malte)\n- Added the Firework Cartridge for the Revolver (BluSunrize)\n- Re-Added IE's Advancements (BluSunrize)\n- Re-Added the Maintenance Kit (BluSunrize)\n- Added the Engineer's Screwdriver (BluSunrize)\n- Added herbicide fluid. It kills leaves and grass (BluSunrize)\n- Re-Added Chutes (BluSunrize)\n- Added the Redstone Controlled conveyor (BluSunrize)\n    - Normal conveyors now ignore redstone\n    - This special one can be disabled with a signal\n- Added the Item Batcher! It collects items until a specified amount is reached, then sends them on (BluSunrize)\n- Added the Redstone Interface Connector! It allows blocks (like the Item Batcher) to send bundled redstone signals (BluSunrize)\n- Re-Added Ore Retrogeneration (phit / Malte)\n- Added \"Igneous Rock\" mineral vein which contains Granite, Diorite, Andesite and Obsidian (BluSunrize)\n- Changed Ear Protectors and Capacitor Backpack to no longer provide armor (BluSunrize)\n- Changed Dieselgen to emit more appropriate smoke particles (TwistedGate)\n- Changed Quarzite vein to only show up in the Nether (BluSunrize)\n- Enabled text overlay (previously colourblind mode) by default (BluSunrize)\n- Enabled metal blocks to be used as Beacon bases (BluSunrize)\n- Expanded available methods for addons (Malte)\n- Fixed countless bits of rendering (Malte & BluSunrize)\n- Fixed a few recipes (BluSunrize)\n- Fixed rendering for revolver cartridges (BluSunrize)\n- Fixed bug in Shaderbag distribution (BluSunrize)\n- Fixed faulty ore gen (Malte)\n- Fixed sync issues (Malte)\n- Fixed worldgen lag (Malte)\n- Fixed recipes for Crusher (Malte)\n- Fixed Probe Connectors (Malte)\n- Fixed Windmills's obstruction code (Malte)\n- Fixed collision on slabs (Malte)\n- Fixed Conveyors crashing on servers (Malte)\n- Fixed connections on Current Transformers (Malte)\n- Fixed missing particles (Malte)\n- Fixed furnace heater being oriented wrong (Malte)\n- Fixed crafting of treated wood with jerrycans (Malte)\n- Fixed Manual entries for Shaders, and other entries (BluSunrize)\n- Fixed wires not being craftable in metal press (Malte)\n- Fixed crashes in the Manual (Malte)\n- Fixed wrong sound when breaking hemp (gyroplast)\n- Fixed glitches with the Skyhook (Malte)\n- Fixed missing recipes for String and Torches (gyroplast)\n- Fixed drops from metal press breaking (Malte)\n- Fixed recipes not being added properly (Malte)\n- Fixed crash with razorwire (Malte)\n- Fixed distance limit on Dieselgen Sounds (BluSunrize)\n- Fixed conveyors crashing when dyed (BluSunrize)\n- Fixed in- & output on the assembler, and bugged recipe handling (BluSunrize)\n- Fixed various issues with the wire network (Malte)\n- Fixed an issue where some blocks allowed too many wires to be attached (Malte)\n- Fixed workbench, cloche and turret not dropping their inventory when their dummy blocks are broken (BluSunrize)"
}