{
    "0.14-93": "- Initial alpha release for Minecraft 1.14.4",
    "0.14-94": "- Added Minecarts!\n    - Wooden crates, reinforced crates, wooden barrels and metal barrels can be put in carts\n    - IE's conveyors can load and unload (extracting conveyor) Minecarts (including vanilla ones!)\n- Re-Added Steel Armor\n- Added vanilla recycling (1 nugget!) for steel tools, steel armor and the faraday suit\n- Change minimum Forge version to 28.2.3\n- Fixed crash due to Minecart render\n- Fixed various rendering glitches\n- Fixed buckets not working\n- Fixed cloche and other dummy-constructed blocks replacing existing blocks\n- Fixed links in the manual's search function\n- Fixed extracting conveyors not being able to rotate their input points\n- Fixed missing vanilla materials in excavator minerals",
    "0.14-95": "- Added the Buzzsaw! It cuts Trees! (BluSunrize)\n- Added full support for the new Villages! (BluSunrize)\n    - Different houses based on biome\n    - 5 different IE Villagers and their workstations:\n        - Structural Engineer, using the new Engineer's Crafting Table\n        - Machinist, using an Anvil\n        - Electrician, using a Current Transformer\n        - Gunsmith, using the Engineer's Workbench\n        - Outfitter, using IE's Shader Banner\n    - All IE villagers vary their outfit based on profession and biome \n- Re-Added Revolver Perks (BluSunrize)\n- Re-Added the Fluid Outlet (Malte)\n- Added the Firework Cartridge for the Revolver (BluSunrize)\n- Re-Added IE's Advancements (BluSunrize)\n- Re-Added the Maintenance Kit (BluSunrize)\n- Added the Engineer's Screwdriver (BluSunrize)\n- Added herbicide fluid. It kills leaves and grass (BluSunrize)\n- Re-Added Chutes (BluSunrize)\n- Added the Redstone Controlled conveyor (BluSunrize)\n    - Normal conveyors now ignore redstone\n    - This special one can be disabled with a signal\n- Added the Item Batcher! It collects items until a specified amount is reached, then sends them on (BluSunrize)\n- Added the Redstone Interface Connector! It allows blocks (like the Item Batcher) to send bundled redstone signals (BluSunrize)\n- Re-Added Ore Retrogeneration (phit / Malte)\n- Added \"Igneous Rock\" mineral vein which contains Granite, Diorite, Andesite and Obsidian (BluSunrize)\n- Changed Ear Protectors and Capacitor Backpack to no longer provide armor (BluSunrize)\n- Changed Dieselgen to emit more appropriate smoke particles (TwistedGate)\n- Changed Quarzite vein to only show up in the Nether (BluSunrize)\n- Enabled text overlay (previously colourblind mode) by default (BluSunrize)\n- Enabled metal blocks to be used as Beacon bases (BluSunrize)\n- Expanded available methods for addons (Malte)\n- Fixed countless bits of rendering (Malte & BluSunrize)\n- Fixed a few recipes (BluSunrize)\n- Fixed rendering for revolver cartridges (BluSunrize)\n- Fixed bug in Shaderbag distribution (BluSunrize)\n- Fixed faulty ore gen (Malte)\n- Fixed sync issues (Malte)\n- Fixed worldgen lag (Malte)\n- Fixed recipes for Crusher (Malte)\n- Fixed Probe Connectors (Malte)\n- Fixed Windmills's obstruction code (Malte)\n- Fixed collision on slabs (Malte)\n- Fixed Conveyors crashing on servers (Malte)\n- Fixed connections on Current Transformers (Malte)\n- Fixed missing particles (Malte)\n- Fixed furnace heater being oriented wrong (Malte)\n- Fixed crafting of treated wood with jerrycans (Malte)\n- Fixed Manual entries for Shaders, and other entries (BluSunrize)\n- Fixed wires not being craftable in metal press (Malte)\n- Fixed crashes in the Manual (Malte)\n- Fixed wrong sound when breaking hemp (gyroplast)\n- Fixed glitches with the Skyhook (Malte)\n- Fixed missing recipes for String and Torches (gyroplast)\n- Fixed drops from metal press breaking (Malte)\n- Fixed recipes not being added properly (Malte)\n- Fixed crash with razorwire (Malte)\n- Fixed distance limit on Dieselgen Sounds (BluSunrize)\n- Fixed conveyors crashing when dyed (BluSunrize)\n- Fixed in- & output on the assembler, and bugged recipe handling (BluSunrize)\n- Fixed various issues with the wire network (Malte)\n- Fixed an issue where some blocks allowed too many wires to be attached (Malte)\n- Fixed workbench, cloche and turret not dropping their inventory when their dummy blocks are broken (BluSunrize)",
    "0.14-96": "- All IE recipes are now JSON based! (BluSunrize)\n    - This includes the excavator's mineral veins. ALL EXISTING VEINS WILL BE BROKEN. The last release was an Alpha, so\n      this has to be expected\n    - Mineral veins have also been changed and rebalanced\n- Overhauled the turntable, to allow side-based redstone input to produce different rotations (MalkContent)\n- Added furnace fuel values for coke coal and coke coal blocks (Malte)\n- Re-Added automatic changelog generation (Malte)\n- Re-Added Graphite Electrode blueprints (BluSunrize)\n- Changed and improved Multiblock bounding boxes (Malte)\n- Changed dropping conveyors to not drop downwards when given redstone signal (MalkContent)\n- Changed hammers and wirecutters to allow repairing (BluSunrize)\n- Changed high-explosive cartridge to not destroy blocks (BluSunrize)\n- Fixed IE ores not generating in non-vanilla biomes (Malte)\n- Fixed IE ores generating in blacklisted dimensions (Malte)\n- Fixed refinery not accepting input fluids when only one tank is filled  (Malte)\n- Fixed crashes when using railguns or revolvers with shaders on a dedicated server (Malte)\n- Fixed some texture and model loading errors (Malte)\n- Fixed scaffolding not acting as a ladder (Malte)\n- Fixed fontrendering issues with Optifine (Malte)\n- Fixed refinery accepting fluid pipes from all sides (BluSunrize)\n- Fixed Voltmeter being broken (Malte)\n- Fixed renders for Bottling Machine and Mixer (Malte)\n- Fixed collision on diagonal covered conveyors (BluSunrize)\n- Fixed recipes for sheetmetal not accepting other mods' plates (BluSunrize)",
    "0.14-97": "- Added fuel gauge for the buzzsaw (BluSunrize)\n- Added a covered version of the splitting conveyor (BluSunrize)\n- Added a steel hoe (BluSunrize)\n- Changed buzzsaw blade quiver to keep the sawblades when removed (BluSunrize)\n- Fixed a crash triggered by other mod's automatic recipe unlocks (BluSunrize)\n- Fixed a crash with the wirecoil tooltips (Malte)\n- Fixed a crash when rendering coresamples with Optifine installed (Malte)\n- Fixed buzzsaw upgrade achievement not triggering (BluSunrize)\n- Fixed buzzsaw and drill not taking damage or requiring fuel when used as weapons (BluSunrize)\n- Fixed wrong transformations for steel tools (Malte)\n- Fixed fluid gauge for the drill going over (Malte)\n- Fixed broken recipe syncing (Malte)"
}